lnhoang1310/Ros_FPT_Project_STM32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Motor_Left_EN_Pin GPIO_PIN_0
#define Motor_Left_EN_GPIO_Port GPIOA
#define Motor_Left_DIR_Pin GPIO_PIN_1
#define Motor_Left_DIR_GPIO_Port GPIOA
#define Motor_Right_DIR_Pin GPIO_PIN_4
#define Motor_Right_DIR_GPIO_Port GPIOA
#define Motor_Right_EN_Pin GPIO_PIN_5
#define Motor_Right_EN_GPIO_Port GPIOA
#define XSHUT_SENSOR_LEFT_Pin GPIO_PIN_6
#define XSHUT_SENSOR_LEFT_GPIO_Port GPIOA
#define XSHUT_SENSOR_HALF_LEFT_Pin GPIO_PIN_7
#define XSHUT_SENSOR_HALF_LEFT_GPIO_Port GPIOA
#define XSHUT_SENSOR_HALF_RIGHT_Pin GPIO_PIN_0
#define XSHUT_SENSOR_HALF_RIGHT_GPIO_Port GPIOB
#define XSHUT_SENSOR_RIGHT_Pin GPIO_PIN_1
#define XSHUT_SENSOR_RIGHT_GPIO_Port GPIOB
#define SOFT_I2C2_SCL_Pin GPIO_PIN_12
#define SOFT_I2C2_SCL_GPIO_Port GPIOB
#define SOFT_I2C2_SDA_Pin GPIO_PIN_13
#define SOFT_I2C2_SDA_GPIO_Port GPIOB
#define SOFT_I2C1_SCL_Pin GPIO_PIN_14
#define SOFT_I2C1_SCL_GPIO_Port GPIOB
#define SOFT_I2C1_SDA_Pin GPIO_PIN_15
#define SOFT_I2C1_SDA_GPIO_Port GPIOB
#define SOFT_I2C3_SCL_Pin GPIO_PIN_8
#define SOFT_I2C3_SCL_GPIO_Port GPIOA
#define SOFT_I2C3_SDA_Pin GPIO_PIN_9
#define SOFT_I2C3_SDA_GPIO_Port GPIOA

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
